package com.jay2u8809.codesamples.individual.algorithm.exam.demae;

/*
    10  進数で表記された N  桁の整数 X  が与えられます。
    N  桁の数字を入れ替えた整数のうち、最小の値を計算してください。ただし、先頭に 0 が含まれるようなものは考えないものとします。

    実装の詳細

    [CLI]
    入力値を標準入力から受け取り、答えを標準出力に表示するCLIアプリケーションを実装してください。
    詳細は末尾の「CLI アプリ作成用テンプレート」を参照ください。

    [入力ルール]
    以下のようにプログラムが実行されます。

    >  ./myApp < input.in

    [input.in]のフォーマットは以下です。

    > X
    制約は以下です。

    - 1 <= n <= 100, 整数
    - x は10  進数で n  桁の整数
    - x の先頭の文字は　0　ではない。

    テストケース内の"簡単なテストケース"では、上記に加えて更に以下の制約を満たします。
    - n <= 9
 */
public class MinNum {
}
